/**
 * ClassName: start
 *
 * @author WQL
 * @Description:
 * @date: 2020/4/10 0:01
 * @since JDK 1.8
 */
public class start {

    /**
     * 正则表达式开始：
     * 例子：^[a-z0-9_-]{3,15}&
     * 开始标记：^
     * 结束标记：&
     * 字母：a-z
     * 数字：0-9
     * 3-15个字符长度：3,15
     *
     * @param args
     */
    public static void main(String[] args) {

        /**
         * 正则表达式大小写敏感
         */

        /**
         * 元字符：
         * . 句号匹配任意单个字符除了换行符
         * [] 字符种类。匹配方括号内的任意字符
         * [^] 否定字符种类。匹配除了方括号内的任意字符
         * * 匹配>=0个重复的在*号之前的字符
         * + 匹配>=1个重复的+号前的字符
         * ? 标记?之前的字符为可选
         * {n,m} 匹配num个大括号之前的字符或字符集 (n <= num <= m)
         * (xyz) 字符集，匹配与 xyz 完全相等的字符串
         * | 或运算符，匹配符号前或后的字符
         * \ 转义字符,用于匹配一些保留的字符 [ ] ( ) { } . * + ? ^ $ \ |
         * ^ 从开始行开始匹配
         * $ 从末端开始匹配
         *
         */

    }
}
